/** 
 * Продолжаем работу над заданием с занятия.
 * Даны два input type=text и кнопка:
 * 1. По нажатию на кнопку данные отправляются на сервер (POST)
 * 2. После загрузки html документа (https://developer.mozilla.org/ru/docs/Web/API/Window/DOMContentLoaded_event)
  делается запрос на получение всех данных (GET) и полученный список отрисовывается под формой
  шаблон для отрисовки: 
  <div>
    <div>${item.userName}</div>
    <div>${item.todoText}</div>
    <div>${item.date}</div>
    <button>Remove</button>
  </div>
 * 3. По нажатию на кнопку Remove должен отправиться запрос (DELETE) на удаление объекта на сервер
  и также объект с данными должен удалится из списка в html документе
 * 4. По нажатию на <div> с текстом todoText должен внутри создаваться input в котороый мы будем вводить новый текст,
  по осбытию onblur будет происходить запрос на обновление данных (PUT), созданный input внутри div будет удаляться,
  а новый текст сохраняться в html
  Пример функционала - https://material-ui.com/components/data-grid/editing/#cell-editing
 * 5. Стилизовать ваше приложение (optional)
 * Notes:
 * server API - https://shatle.herokuapp.com (так как сервер бесплатный, то если не шлются запросы более 30 минут, то сервер засыпает. Если сделать запрос когда он спит, придется подождать чтобы он проснулся несколько секунд. Имейте это ввиду)
 * Документация по маршрутам - https://shatle.herokuapp.com/swagger/#/ - сдесь показано какие данные и по каким маршрутам сервер ожидает получить
 */
