/**
 * Задача 1
 * Внутри функции дан объект. Нобходимо деструктуризировать все ключи объекта
 * и его вложенных объектов и вернуть массив этих значений.
 * @returns {Array}
 */
const fn1 = () => {
  const obj = {
    x: 1,
    y: 2,
    z: 3,
    obj1: {
      x: 4,
      y: 5,
      z: 6,
      obj2: {
        x: 7,
        y: 8,
        z: 9
      },
    },
  };
};

/**
 * Задача 2
 * Написать рекурсивную функцию, которая вычеслит сумму чисел 1 + 2 + ... + n
 * @param {Number} n
 * @returns {Number}
 * @example sum(4) = 4 + 3 + 2 + 1 = 10
 */
const sum = (n) => {

};

/**
 * Задача 3
 * Написать функцию, которая прнимает:
 * первым параметром массив ключей
 * вторым параметром объект
 * и возвращает массив значений из данного объекта.
 * Если в объекте нет такого ключа - вернуть undefined
 * @example props(['c', 'a', 'b'], {b: 2, a: 1}); //=> [undefined, 1, 2]
 * @param {Array}
 * @param {Object}
 * @returns {Array}
 */
const props = (arr, obj) => {

};

/**
 * Задача 4
 * Дан массив повторяющихся чисел.
 * Написать функцию которая вернет массив уникальный чисел (избавится от повторяющихся значений)
 * @param {Array}
 * @returns {Array}
 * @example dropRepeats([1, 1, 1, 2, 3, 4, 4, 2, 2]); //=> [1, 2, 3, 4, 2]
 */
const dropRepeats = (arr) => {

};

/**
 * Задача 5
 * Дан массив объектов:
  const users = [
    { name: "John", age: 20, surname: "Johnson" },
    { name: "Pete", age: 18, surname: "Peterson" },
    { name: "Ann", age: 19, surname: "Hathaway" }
  ];
  Как выглядит фнукция сортировки по возрасту - users.sort((a, b) => a.age > b.age ? 1 : -1);
  * Необходимо написать функцию которая принимает строку (ключ объекта) по которому нужно сортировать массив
  * @example users.sort(byField('age'));
 */
const byField = (field) => {

};
