// НА КАЖДУЮ ЗАДАЧУ НУЖНО СОЗДАТЬ ОТДЕЛЬНЫЙ HTML ФАЙЛ //

/**
 * Задача 1
 * Дана кнопка button и input type="text" который должен считывать только цифры. 
 * Если в инпут введено число 2, то по нажатию на кнопку должно генерироваться сетка 2х2 со случайным набором чисел внутри блока
 * если число 3, то 3х3
 * Пример сетки 3x3 - https://ibb.co/dm8bp9q
 * [1][3][2] - где блок [] обычный элемент div, а содержимое случайное число
 * [7][5][6]
 * [4][8][9]
 */

/**
 * Задача 2
 * Получить данные c сервера по маршруту - https://jsonplaceholder.typicode.com/posts
 * Из полученных данных создать список аккордеонов - https://material-ui.com/components/accordion/#simple-accordion
 * где загаловок аккордеона и его содержимое это title и body из полученного массива объектов соответственно
 * Функцию реализовать с помощью async/await
 */
